nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/dma/processor/dma_p32mx570f512l.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _DMA_P32MX570F512L_H
#define _DMA_P32MX570F512L_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    DMA_ID_0 = _DMAC_BASE_ADDRESS,
    DMA_NUMBER_OF_MODULES = 1

} DMA_MODULE_ID;

typedef enum {

    DMA_CHANNEL_0 = 0x0,
    DMA_CHANNEL_1 = 0x1,
    DMA_CHANNEL_2 = 0x2,
    DMA_CHANNEL_3 = 0x3,
    DMA_NUMBER_OF_CHANNELS = 0x4

} DMA_CHANNEL;

typedef enum {

    DMA_CHANNEL_0_INT_SOURCE = 72,
    DMA_CHANNEL_1_INT_SOURCE = 73,
    DMA_CHANNEL_2_INT_SOURCE = 74,
    DMA_CHANNEL_3_INT_SOURCE = 75

} DMA_CHANNEL_INT_SOURCE;

typedef enum {

    DMA_CHANNEL_PRIORITY_0 = 0x0,
    DMA_CHANNEL_PRIORITY_1 = 0x1,
    DMA_CHANNEL_PRIORITY_2 = 0x2,
    DMA_CHANNEL_PRIORITY_3 = 0x3

} DMA_CHANNEL_PRIORITY;

typedef enum {

    DMA_CHANNEL_TRIGGER_TRANSFER_START = 0x0,
    DMA_CHANNEL_TRIGGER_TRANSFER_ABORT = 0x1,
    DMA_CHANNEL_TRIGGER_PATTERN_MATCH_ABORT = 0x2

} DMA_CHANNEL_TRIGGER_TYPE;

typedef enum {

    DMA_TRIGGER_SOURCE_NONE = -1,
    DMA_TRIGGER_TIMER_CORE = 0,
    DMA_TRIGGER_SOFTWARE_0 = 1,
    DMA_TRIGGER_SOFTWARE_1 = 2,
    DMA_TRIGGER_EXTERNAL_0 = 3,
    DMA_TRIGGER_EXTERNAL_1 = 8,
    DMA_TRIGGER_EXTERNAL_2 = 13,
    DMA_TRIGGER_EXTERNAL_3 = 18,
    DMA_TRIGGER_EXTERNAL_4 = 23,
    DMA_TRIGGER_TIMER_1 = 4,
    DMA_TRIGGER_TIMER_2 = 9,
    DMA_TRIGGER_TIMER_3 = 14,
    DMA_TRIGGER_TIMER_4 = 19,
    DMA_TRIGGER_TIMER_5 = 24,
    DMA_TRIGGER_INPUT_CAPTURE_1 = 6,
    DMA_TRIGGER_INPUT_CAPTURE_2 = 11,
    DMA_TRIGGER_INPUT_CAPTURE_3 = 16,
    DMA_TRIGGER_INPUT_CAPTURE_4 = 21,
    DMA_TRIGGER_INPUT_CAPTURE_5 = 26,
    DMA_TRIGGER_INPUT_CAPTURE_1_ERROR = 5,
    DMA_TRIGGER_INPUT_CAPTURE_2_ERROR = 10,
    DMA_TRIGGER_INPUT_CAPTURE_3_ERROR = 15,
    DMA_TRIGGER_INPUT_CAPTURE_4_ERROR = 20,
    DMA_TRIGGER_INPUT_CAPTURE_5_ERROR = 25,
    DMA_TRIGGER_OUTPUT_COMPARE_1 = 7,
    DMA_TRIGGER_OUTPUT_COMPARE_2 = 12,
    DMA_TRIGGER_OUTPUT_COMPARE_3 = 17,
    DMA_TRIGGER_OUTPUT_COMPARE_4 = 22,
    DMA_TRIGGER_OUTPUT_COMPARE_5 = 27,
    DMA_TRIGGER_SPI_1_ERROR = 35,
    DMA_TRIGGER_SPI_1_RECEIVE = 36,
    DMA_TRIGGER_SPI_1_TRANSMIT = 37,
    DMA_TRIGGER_SPI_2_ERROR = 53,
    DMA_TRIGGER_SPI_2_RECEIVE = 54,
    DMA_TRIGGER_SPI_2_TRANSMIT = 55,
    DMA_TRIGGER_SPI_3_ERROR = 78,
    DMA_TRIGGER_SPI_3_RECEIVE = 79,
    DMA_TRIGGER_SPI_3_TRANSMIT = 80,
    DMA_TRIGGER_SPI_4_ERROR = 81,
    DMA_TRIGGER_SPI_4_RECEIVE = 82,
    DMA_TRIGGER_SPI_4_TRANSMIT = 83,
    DMA_TRIGGER_I2C_1_ERROR = 41,
    DMA_TRIGGER_I2C_1_SLAVE = 42,
    DMA_TRIGGER_I2C_1_MASTER = 43,
    DMA_TRIGGER_I2C_2_ERROR = 59,
    DMA_TRIGGER_I2C_2_SLAVE = 60,
    DMA_TRIGGER_I2C_2_MASTER = 61,
    DMA_TRIGGER_USART_1_ERROR = 38,
    DMA_TRIGGER_USART_1_RECEIVE = 39,
    DMA_TRIGGER_USART_1_TRANSMIT = 40,
    DMA_TRIGGER_USART_2_ERROR = 56,
    DMA_TRIGGER_USART_2_RECEIVE = 57,
    DMA_TRIGGER_USART_2_TRANSMIT = 58,
    DMA_TRIGGER_USART_3_ERROR = 62,
    DMA_TRIGGER_USART_3_RECEIVE = 63,
    DMA_TRIGGER_USART_3_TRANSMIT = 64,
    DMA_TRIGGER_USART_4_ERROR = 65,
    DMA_TRIGGER_USART_4_RECEIVE = 66,
    DMA_TRIGGER_USART_4_TRANSMIT = 67,
    DMA_TRIGGER_USART_5_ERROR = 68,
    DMA_TRIGGER_USART_5_RECEIVE = 69,
    DMA_TRIGGER_USART_5_TRANSMIT = 70,
    DMA_TRIGGER_CHANGE_NOTICE_A = 44,
    DMA_TRIGGER_CHANGE_NOTICE_B = 45,
    DMA_TRIGGER_CHANGE_NOTICE_C = 46,
    DMA_TRIGGER_CHANGE_NOTICE_D = 47,
    DMA_TRIGGER_CHANGE_NOTICE_E = 48,
    DMA_TRIGGER_CHANGE_NOTICE_F = 49,
    DMA_TRIGGER_CHANGE_NOTICE_G = 50,
    DMA_TRIGGER_DMA_0 = 72,
    DMA_TRIGGER_DMA_1 = 73,
    DMA_TRIGGER_DMA_2 = 74,
    DMA_TRIGGER_DMA_3 = 75,
    DMA_TRIGGER_COMPARATOR_1 = 32,
    DMA_TRIGGER_COMPARATOR_2 = 33,
    DMA_TRIGGER_COMPARATOR_3 = 76,
    DMA_TRIGGER_ADC_1 = 28,
    DMA_TRIGGER_PARALLEL_PORT = 51,
    DMA_TRIGGER_CAN_1 = 77,
    DMA_TRIGGER_CLOCK_MONITOR = 29,
    DMA_TRIGGER_RTCC = 30,
    DMA_TRIGGER_FLASH_CONTROL = 31,
    DMA_TRIGGER_USB_1 = 34,
    DMA_TRIGGER_PARALLEL_PORT_ERROR = 52,
    DMA_TRIGGER_CTMU = 71

} DMA_TRIGGER_SOURCE;

typedef enum {

    DMA_CRC_IP_HEADER = 0x1,
    DMA_CRC_LFSR = 0x0

} DMA_CRC_TYPE;

typedef enum {

    DMA_CRC_BYTEORDER_NO_SWAPPING = 0x0,
    DMA_CRC_SWAP_BYTE_ON_WORD_BOUNDARY = 0x1,
    DMA_CRC_SWAP_HALF_WORD_ON_WORD_BOUNDARY = 0x2,
    DMA_CRC_SWAP_BYTE_ON_HALF_WORD_BOUNDARY = 0x3

} DMA_CRC_BYTE_ORDER;

typedef enum {

    DMA_INT_ADDRESS_ERROR = 0x1,
    DMA_INT_TRANSFER_ABORT = 0x2,
    DMA_INT_CELL_TRANSFER_COMPLETE = 0x4,
    DMA_INT_BLOCK_TRANSFER_COMPLETE = 0x8,
    DMA_INT_DESTINATION_HALF_FULL = 0x10,
    DMA_INT_DESTINATION_DONE = 0x20,
    DMA_INT_SOURCE_HALF_EMPTY = 0x40,
    DMA_INT_SOURCE_DONE = 0x80

} DMA_INT_TYPE;

typedef enum {

    DMA_CRC_BIT_ORDER_LSB = 0x1,
    DMA_CRC_BIT_ORDER_MSB = 0x0

} DMA_CRC_BIT_ORDER;

typedef enum {

    DMA_PATTERN_LENGTH_NONE

} DMA_PATTERN_LENGTH;

typedef enum {

    DMA_CHANNEL_COLLISION_NOT_SUPPORTED = 0x0

} DMA_CHANNEL_COLLISION;

typedef enum {

    DMA_PING_PONG_MODE_NOT_SUPPORTED = 0x0

} DMA_PING_PONG_MODE;

typedef enum {

    DMA_CHANNEL_TRANSFER_DIRECTION_NOT_SUPPORTED = 0

} DMA_CHANNEL_TRANSFER_DIRECTION;

typedef enum {

    DMA_ADDRESS_OFFSET_TYPE_NOT_SUPPORTED = 0

} DMA_ADDRESS_OFFSET_TYPE;

typedef enum {

    DMA_SOURCE_ADDRESSING_MODE_NOT_SUPPORTED = 0

} DMA_SOURCE_ADDRESSING_MODE;

typedef enum {

    DMA_DESTINATION_ADDRESSING_MODE_NOT_SUPPORTED = 0

} DMA_DESTINATION_ADDRESSING_MODE;

typedef enum {

    DMA_CHANNEL_ADDRESSING_MODE_NOT_SUPPORTED = 0

} DMA_CHANNEL_ADDRESSING_MODE;

typedef enum {

    DMA_CHANNEL_DATA_SIZE_NOT_SUPPORTED = 0

} DMA_CHANNEL_DATA_SIZE;

typedef enum {

    DMA_TRANSFER_MODE_NOT_SUPPORTED = 0

} DMA_TRANSFER_MODE;

/* Section 2 - Feature variant inclusion */

